{
    "title": "Programação em Java",
    "topic": "Vetores (Arrays) em Java",
    "knowledge": "Conhecimento básico em sintaxe Java",
    "origin": "[Inserir de onde o material para o worked example foi retirado]",
    "description": "Escreva um programa em Java que crie um vetor de números pares entre 1 e 20 e imprima a lista.",
    "result": "O programa deve criar um vetor de números pares e imprimir a o vetor com esses números.",
    "extra": "[Inserir material de apoio para resolução do problema]",
    "problemWECorrect": {
        "thinking": "Este exemplo demonstra como criar um vetor em Java e preenchê-lo com números pares dentro de um intervalo específico. Isso requer o uso de um loop e condições para determinar se um número é par. É um exercício útil para praticar o uso de arrays e loops.",
        "solutionProposal": {
            "steps": "\n[PASSO 1]. Crie um vetor (array) de inteiros para armazenar os números pares. \n[PASSO 2]. Use um loop 'for' para iterar de 1 a 20. \n[PASSO 3]. Dentro do loop, verifique se o número é par (divisível por 2 com resto igual a 0) e, se for par, adicione-o ao vetor. \n[PASSO 4]. Após o loop, imprima os números no vetor.",
            "test": "Execute o programa e verifique se ele cria um vetor de números pares entre 1 e 20 e imprime a lista corretamente."
        },
        "correctSolutionProposal": "```java\npublic class NumerosPares {\n    public static void main(String[] args) {\n        int[] numerosPares = new int[10];\n        int index = 0;\n\n        for (int i = 1; i <= 20; i++) {\n            if (i % 2 == 0) {\n                numerosPares[index] = i;\n                index++;\n            }\n        }\n\n        for (int numero : numerosPares) {\n            System.out.println(numero);\n        }\n    }\n}\n```"
    },
    "problemWEIncorrect": {
        "thinking": "O exemplo incorreto apresenta um erro que afeta a lógica do programa. Isso serve para destacar a importância da correta identificação de números pares e o armazenamento deles no vetor.",
        "incorrectSolution": "```java\npublic class NumerosParesIncorreto {\n    public static void main(String[] args) {\n        int[] numerosPares = new int[10];\n        int index = 0;\n\n        for (int i = 1; i <= 20; i++) {\n            if (i % 2 != 0) {\n                numerosPares[index] = i;\n                index++;\n            }\n        }\n\n        for (int numero : numerosPares) {\n            System.out.println(numero);\n        }\n    }\n}\n```",
        "test": "Execute o programa e verifique se ele cria um vetor de números pares incorretamente.",
        "options": {
            "one": "linha 2",
            "two": "linhas de 4 e 5",
            "three": "linha de 7",
            "four": "linha 8",
            "five": "não sei identificar"
        },
        "correctOption": "1",
        "error": "O erro está na condição dentro do loop 'for'. A condição 'if (i % 2 != 0)' verifica se um número é ímpar em vez de par. Isso faz com que o programa armazene números ímpares no vetor.",
        "response": "O erro ocorre na parte 'if (i % 2 != 0)'. Essa condição verifica se um número é ímpar, o que não é o objetivo do programa. A condição correta deve ser 'if (i % 2 == 0)' para verificar se um número é par.",
        "correctSolutionProposal": "[PASSO 1] Modificar a condição do loop para 'if (i % 2 == 0)'. \n[PASSO 2] Execute o programa novamente para verificar se agora cria e imprime corretamente a lista de números pares."
    }
}